Revit 2027 API
TextBox.Width Property
Gets or sets the width of the TextBox.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Width { get; set; }
Public Property Width As Double
	Get
	Set
public:
property double Width {
	double get ();
	void set (double value);
}
member Width : float with get, set
Property Value
Double
Remarks
The value for this property must be positive and cannot be Infinity. This value is interpreted in device-independent units (1/96th inch) measurement device-independent units. The default value is 200.
See Also
Reference
TextBox Class
Autodesk.Revit.UI Namespace